docs/pgmforfun.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-10 Sat 23:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42: Programs For Functions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="free42/hp-42s/DM42 programs for working with MVAR functions"
 />













</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42: Programs For Functions</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-04-10 23:48:40</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdcbfc00">1. Metadata</a></li>
<li><a href="#org3fd031c">2. Introduction</a></li>
<li><a href="#org7fa3224">3. Test Functions</a></li>
<li><a href="#org5305fff">4. Utility Functions</a>
<ul>
<li><a href="#orgb5cd761">4.1. <code>WRPF</code>: Wrap simple functions with <code>MVAR</code> program</a></li>
<li><a href="#org1cc64e5">4.2. <code>PICF</code>: Interactively Query For <code>MVAR</code> Program, Variable, and Number of Returns</a></li>
</ul>
</li>
<li><a href="#orgbfe1596">5. <code>FSPT</code>: Interactive Sums, Products, &amp; Tables</a></li>
<li><a href="#org7c0f809">6. Programmatic Sums &amp; Products</a>
<ul>
<li><a href="#org68bee0e">6.1. <code>FSUM</code>: Sums</a></li>
<li><a href="#org61b7529">6.2. <code>FPRD</code>: Products</a></li>
</ul>
</li>
<li><a href="#org9188e92">7. Roots &amp; Integrals</a>
<ul>
<li><a href="#org0f7d152">7.1. <code>FSLV</code>: Find a root</a></li>
<li><a href="#orgba51184">7.2. <code>FINT</code>: Integrate</a></li>
</ul>
</li>
<li><a href="#org4f4e2f4">8. Evaluation</a>
<ul>
<li><a href="#org6d87ca5">8.1. <code>FEVL</code>: Quickly Evaluate A Function</a></li>
</ul>
</li>
<li><a href="#orgba40afc">9. Plots</a>
<ul>
<li><a href="#orgb43f792">9.1. User Interface</a>
<ul>
<li><a href="#orga983677">9.1.1. Main Menu</a></li>
</ul>
</li>
<li><a href="#org9a70ca7">9.2. Computational Menu</a>
<ul>
<li><a href="#orgcb1af79">9.2.1. Graphics Display</a></li>
</ul>
</li>
<li><a href="#org8c6bb1c">9.3. <code>FPLT</code>: Plot functions</a></li>
</ul>
</li>
<li><a href="#org22e4f3d">10. Menus</a>
<ul>
<li><a href="#org2478295">10.1. <code>FVARM</code>: Global Variables Menu</a></li>
<li><a href="#orgccbaf02">10.2. <code>FMENU</code>: Main menu for all apps</a></li>
</ul>
</li>
<li><a href="#org493edc2">11. EOF</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdcbfc00" class="outline-2">
<h2 id="orgdcbfc00"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
This home for this HTML file is: <a href="https://richmit.github.io/hp42/pgmforfun.html">https://richmit.github.io/hp42/pgmforfun.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<p>
Directory contents:
</p>
<ul class="org-ul">
<li><code>src</code>: The org-mode file that generated this HTML document</li>
<li><code>src_42s</code>: Ready to convert source listings for 42s code in this document</li>
<li><code>docs</code>: This html document</li>
<li><code>bin</code>: Importable RAW program files</li>
</ul>
</div>
</div>
