src/pgmforfun.org
* Introduction

$$\mathrm{Plots} \;\;\;\;\;\;\; \mathrm{Sums} \;\; \sum_{n=1}^{15}\frac{1}{n^2} \;\;\;\;\;\;\; \mathrm{Products} \;\; \prod_{n=1}^{15}\frac{1}{n^2} \;\;\;\;\;\;\; \mathrm{Integrals} \;\; \int_{1}^{15}\frac{1}{x^2}dx \;\;\;\;\;\;\; \mathrm{Roots} $$

This is an odd collection of programs that work with =MVAR=-type programs (equations).  I was inspired to do this when the =PGMENU= function was added to
free42.  My current plans include the following programs:

#+ATTR_HTML: :align center
|---------+------------------------------------------------------------------+------------|
| Program | Description                                                      | Status     |
|---------+------------------------------------------------------------------+------------|
| =FSPT=  | Interactive application for computing Sums, Products, and Tables | *Complete* |
| =FPLT=  | Interactive application for plotting a function                  | *Complete* |
|---------+------------------------------------------------------------------+------------|
| =FSLV=  | Solve EqP for EqV in [LLIM, ULIM]                                | *Complete* |
| =FINT=  | Integrate EqP for EqV in [LLIM, ULIM]                            | *Complete* |
| =FSUM=  | Sum EqP for values of EqV from LLIM to ULIM stepping by STEP     | *Complete* |
| =FPRD=  | Product EqP for values of EqV from LLIM to ULIM stepping by STEP | *Complete* |
|---------+------------------------------------------------------------------+------------|
| =PICF=  | Interactive application to select and describe an =MVAR= program | *Complete* |
| =WRPF=  | Wrap a simple function inside an =MVAR= program                  | *Complete* |
|---------+------------------------------------------------------------------+------------|
| =FVARM= | MVAR program with all the global variables for these apps        | *Complete* |
| =FMENU= | Menu program orginizeing these apps                              | *Complete* |
|---------+------------------------------------------------------------------+------------|

My thinking for such programs is that they share a framework and common  principals.

All the top level programs use =PICF= to collect information about the =MVAR= program to be used.  The collected information is housed in three global
variables:

#+ATTR_HTML: :align center
|----------+-------------------------------------|
| Variable | Contents                            |
|----------+-------------------------------------|
| =EqP=    | Name of MVAR program                |
| =EqV=    | Name of independent variable        |
| =EqD=    | Number of returns from MVAR program |
|----------+-------------------------------------|

Depending on what we are doing with the =MVAR= program, we may need to know something about the independent variable too.  For example when summing function
values we need to know lower and upper ranges over which to sum, and a step size by which to increment the variable.  We use a consistent set of global
variables based upon names used by built in tools:

#+ATTR_HTML: :align center
|----------+-------------------------------------|
| Variable | Contents                            |
|----------+-------------------------------------|
| =LLIM=   | Lower limit of independent variable |
| =ULIM=   | Upper limit of independent variable |
| =STEP=   | A step size                         |
|----------+-------------------------------------|

If a second variable is used, then similar variables are used; however, we have no precedent for what to name them.  So I have decided to use the following:

#+ATTR_HTML: :align center
|----------+------------------------------------------------|
| Variable | Contents                                       |
|----------+------------------------------------------------|
| =YMIN=   | Lower limit of second or dependent variable    |
| =YMAX=   | Upper limit of second or dependent variable    |
| =YSTP=   | A step size for a second or dependent variable |
|----------+------------------------------------------------|

If an accuracy is required, then we use the variable =ACC=.

