docs/pgmforfun.html

<div id="outline-container-org3fd031c" class="outline-2">
<h2 id="org3fd031c"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
\[\mathrm{Plots} \;\;\;\;\;\;\; \mathrm{Sums} \;\; \sum_{n=1}^{15}\frac{1}{n^2} \;\;\;\;\;\;\; \mathrm{Products} \;\; \prod_{n=1}^{15}\frac{1}{n^2} \;\;\;\;\;\;\; \mathrm{Integrals} \;\; \int_{1}^{15}\frac{1}{x^2}dx \;\;\;\;\;\;\; \mathrm{Roots} \]
</p>

<p>
This is an odd collection of programs that work with <code>MVAR</code>-type programs (equations).  I was inspired to do this when the <code>PGMENU</code> function was added to
free42.  My current plans include the following programs:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Program</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>FSPT</code></td>
<td class="org-left">Interactive application for computing Sums, Products, and Tables</td>
<td class="org-left"><b>Complete</b></td>
</tr>

<tr>
<td class="org-left"><code>FPLT</code></td>
<td class="org-left">Interactive application for plotting a function</td>
<td class="org-left"><b>Complete</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>FSLV</code></td>
<td class="org-left">Solve EqP for EqV in [LLIM, ULIM]</td>
<td class="org-left"><b>Complete</b></td>
</tr>

<tr>
<td class="org-left"><code>FINT</code></td>
<td class="org-left">Integrate EqP for EqV in [LLIM, ULIM]</td>
<td class="org-left"><b>Complete</b></td>
</tr>

<tr>
<td class="org-left"><code>FSUM</code></td>
<td class="org-left">Sum EqP for values of EqV from LLIM to ULIM stepping by STEP</td>
<td class="org-left"><b>Complete</b></td>
</tr>

<tr>
<td class="org-left"><code>FPRD</code></td>
<td class="org-left">Product EqP for values of EqV from LLIM to ULIM stepping by STEP</td>
<td class="org-left"><b>Complete</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>PICF</code></td>
<td class="org-left">Interactive application to select and describe an <code>MVAR</code> program</td>
<td class="org-left"><b>Complete</b></td>
</tr>

<tr>
<td class="org-left"><code>WRPF</code></td>
<td class="org-left">Wrap a simple function inside an <code>MVAR</code> program</td>
<td class="org-left"><b>Complete</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>FVARM</code></td>
<td class="org-left">MVAR program with all the global variables for these apps</td>
<td class="org-left"><b>Complete</b></td>
</tr>

<tr>
<td class="org-left"><code>FMENU</code></td>
<td class="org-left">Menu program orginizeing these apps</td>
<td class="org-left"><b>Complete</b></td>
</tr>
</tbody>
</table>

<p>
My thinking for such programs is that they share a framework and common  principals.
</p>

<p>
All the top level programs use <code>PICF</code> to collect information about the <code>MVAR</code> program to be used.  The collected information is housed in three global
variables:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Contents</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>EqP</code></td>
<td class="org-left">Name of MVAR program</td>
</tr>

<tr>
<td class="org-left"><code>EqV</code></td>
<td class="org-left">Name of independent variable</td>
</tr>

<tr>
<td class="org-left"><code>EqD</code></td>
<td class="org-left">Number of returns from MVAR program</td>
</tr>
</tbody>
</table>

<p>
Depending on what we are doing with the <code>MVAR</code> program, we may need to know something about the independent variable too.  For example when summing function
values we need to know lower and upper ranges over which to sum, and a step size by which to increment the variable.  We use a consistent set of global
variables based upon names used by built in tools:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Contents</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>LLIM</code></td>
<td class="org-left">Lower limit of independent variable</td>
</tr>

<tr>
<td class="org-left"><code>ULIM</code></td>
<td class="org-left">Upper limit of independent variable</td>
</tr>

<tr>
<td class="org-left"><code>STEP</code></td>
<td class="org-left">A step size</td>
</tr>
</tbody>
</table>

<p>
If a second variable is used, then similar variables are used; however, we have no precedent for what to name them.  So I have decided to use the following:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Contents</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>YMIN</code></td>
<td class="org-left">Lower limit of second or dependent variable</td>
</tr>

<tr>
<td class="org-left"><code>YMAX</code></td>
<td class="org-left">Upper limit of second or dependent variable</td>
</tr>

<tr>
<td class="org-left"><code>YSTP</code></td>
<td class="org-left">A step size for a second or dependent variable</td>
</tr>
</tbody>
</table>

<p>
If an accuracy is required, then we use the variable <code>ACC</code>.
</p>
</div>
</div>
