docs/pgmforfun.html

<div id="outline-container-org7fa3224" class="outline-2">
<h2 id="org7fa3224"><span class="section-number-2">3</span> Test Functions</h2>
<div class="outline-text-2" id="text-3">
<p>
A few <code>MVAR</code> functions to test with
</p>

<div class="org-src-container">
<pre class="src src-hp42s">
<span id="coderef-TFS" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFS)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: SIGN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFS"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">SIGN</span>
5
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFE" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFE)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Exponential</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFE"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">E&#8593;X</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFL" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFL)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Linear M*X+B</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFL"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"M"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"B"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"M"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"B"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFQ" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFQ)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: A quadratic with zeros at 0 and 1</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFQ"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFC" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFC)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: A cubic with zeros at -1, 0.9, and 1</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFC"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
.9
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFO" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFO)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: A function that with increasing frequency approaching zero</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFO"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">ABS</span>
0.001
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">SIN</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFI" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFI)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: A function that has many undefined regions</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Good test to make sure we don't connect across known discontinuities</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFI"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
2
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">1/X</span>
5
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFM" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFM)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: A function that has many step discontinuities</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFM"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
2
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">IP</span>
.5
<span style="color: #00ffff;">-</span>
10
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>

<span id="coderef-TFF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (TFF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: A function flips between 1 and -1 each call</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Worst case performance for connecting dots</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TFF"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
5
<span style="color: #00ffff;">FS?C</span> 85
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">SF</span> 85
-5
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5305fff" class="outline-2">
<h2 id="org5305fff"><span class="section-number-2">4</span> Utility Functions</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb5cd761" class="outline-3">
<h3 id="orgb5cd761"><span class="section-number-3">4.1</span> <code>WRPF</code>: Wrap simple functions with <code>MVAR</code> program</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Sometimes we need to work with a simple function that takes an argument from the stack and returns one or more values to the stack &#x2013; i.e. non "MVAR"
variables.  To work with such functions we can wrap them.  A generic solution might be to store the name of your simple function in the variable "IEqV", and
then give "WRPF" to solver, integrator, or <code>FSPT</code> program.
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-WRPF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (WRPF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Wrap a simple function inside an =MVAR= program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"WRPF"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">XEQ IND</span> <span style="color: #fa8072;">"IEqV"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
