src/pgmforfun.org
** =PICF=: Interactively Query For =MVAR= Program, Variable, and Number of Returns

#+begin_src hp42s :tangle ../src_42s/pgmforfun/pgmforfun.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:PICF)
@@@@ DSC: Pick an MVAR function and variable
@@@@ IN:  X: integer
@@@@ FAQ: If X=0, then EqD is set to 1.  Otherwise the user is prompted.
@@@@ UPD: 2021-02-24
@@@@ GBL: EqP  -- Name of selected function
@@@@ GBL: EqV -- Name of selected variable
@@@@ GBL: EqD -- Return count
@@@@ BUG: Variable menu works like solver, not like integrator.  Can't fix that...
@@@@ REQ: REQ:free42>=3.0
LBL "PICF"
FUNC 10
L4STK
CLV "EqP"
CLV "EqV"
CLV "EqD"
X≠0?
GTO 08
1
STO "EqD"
LBL 08
EXITALL
PGMMENU
"Pick Function"
AVIEW
STOP
ASTO "EqP"
EXITALL
VARMENU IND "EqP"
"Set Var; "
├"Pick Free Var"
AVIEW
STOP
ASTO "EqV"
EXITALL
SF 25
RCL "EqD"
FS?C 25
GTO 07
"Select Return"
├" Count"
AVIEW
CLMENU
"1"
KEY 1 XEQ 02
"2"
KEY 2 XEQ 03
"3"
KEY 3 XEQ 04
"4"
KEY 4 XEQ 05
MENU
STOP
EXITALL
STO "EqD"
LBL 07
"F: "
ARCL "EqP"
├"("
ARCL "EqV"
├"):→"
ARCL "EqD"
AVIEW
RTN
LBL 02
1
RTN
LBL 03
2
RTN
LBL 04
3
RTN
LBL 05
4
RTN
END
#+END_SRC

