docs/pgmforfun.html

<div id="outline-container-org1cc64e5" class="outline-3">
<h3 id="org1cc64e5"><span class="section-number-3">4.2</span> <code>PICF</code>: Interactively Query For <code>MVAR</code> Program, Variable, and Number of Returns</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-PICF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (PICF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Pick an MVAR function and variable</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: integer</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: If X=0, then EqD is set to 1.  Otherwise the user is prompted.</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-24</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: EqP  -- Name of selected function</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: EqV -- Name of selected variable</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: EqD -- Return count</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Variable menu works like solver, not like integrator.  Can't fix that...</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"PICF"</span>
<span style="color: #00ffff;">FUNC</span> 10
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">X&#8800;0</span>?
<span style="color: #00ffff;">GTO</span> 08
1
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">LBL</span> 08
<span style="color: #00ffff;">EXITALL</span>
PGMMENU
<span style="color: #fa8072;">"Pick Function"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">ASTO</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">VARMENU</span> IND <span style="color: #fa8072;">"EqP"</span>
<span style="color: #fa8072;">"Set Var; "</span>
&#9500;<span style="color: #fa8072;">"Pick Free Var"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">ASTO</span> <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #fa8072;">"Select Return"</span>
&#9500;<span style="color: #fa8072;">" Count"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"1"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 02
<span style="color: #fa8072;">"2"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 03
<span style="color: #fa8072;">"3"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 04
<span style="color: #fa8072;">"4"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 05
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">LBL</span> 07
<span style="color: #fa8072;">"F: "</span>
<span style="color: #00ffff;">ARCL</span> <span style="color: #fa8072;">"EqP"</span>
&#9500;<span style="color: #fa8072;">"("</span>
<span style="color: #00ffff;">ARCL</span> <span style="color: #fa8072;">"EqV"</span>
&#9500;<span style="color: #fa8072;">"):&#8594;"</span>
<span style="color: #00ffff;">ARCL</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 02
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 03
2
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 04
3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 05
4
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>
