docs/pgmforfun.html

<div id="outline-container-orgbfe1596" class="outline-2">
<h2 id="orgbfe1596"><span class="section-number-2">5</span> <code>FSPT</code>: Interactive Sums, Products, &amp; Tables</h2>
<div class="outline-text-2" id="text-5">
<p>
Create function tables and computes sums &amp; products.  Works much like the built in integration application.
</p>

<p>
The <code>LOG</code> button transforms the function results by taking the natural logarithm &#x2013; for example this allows us to compute very large products by summing the logarithms.
</p>

<p>
The <code>IND</code> button stores the independent variable value in the table.
</p>

<p>
When not provided, the values for <code>LLIM</code>, <code>STEP</code>, &amp; <code>EqD</code> default to 1.
</p>

<p>
Note: Using <code>[SHIFT]</code> before <code>[LLIM]</code>, <code>[ULIM]</code>, and <code>[STEP]</code> menu keys will recall the current value to the stack instead of setting the value.
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FSPT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FSPT)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Sums, Products, &amp; Tables</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  N/A</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: N/A</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-03</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: LLIM -- Lower limit for variable</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: ULIM -- Upper limit for variable</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: STEP -- Size of steps to make</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 82: Set: log function returns</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 83: Set: Store independent variable in table</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 84: Set: doing table, Clear: Doing sum or product (see flag 85)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 85: Set: doing sum, Clear; doing product</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LLB: 00-12,14-24,26-33</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GLB: FSPT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">USE: PICF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FSPT"</span>
<span style="color: #00ffff;">CF</span> 82
<span style="color: #00ffff;">SF</span> 83
1
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"PICF"</span>
R&#8595;
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu PROG_NAME</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 03
<span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 04
<span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 05
<span style="color: #fa8072;">"&#931;"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 06
<span style="color: #fa8072;">"&#960;"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 07
<span style="color: #fa8072;">"&#9618;"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 08
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu PROG_NAME</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"EQ"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 09
<span style="color: #00ffff;">FS</span>? 82
<span style="color: #fa8072;">"LN&#8226;"</span>
<span style="color: #00ffff;">FC</span>? 82
<span style="color: #fa8072;">"LN"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 10
<span style="color: #00ffff;">FS</span>? 83
<span style="color: #fa8072;">"IND&#8226;"</span>
<span style="color: #00ffff;">FC</span>? 83
<span style="color: #fa8072;">"IND"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 11
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 00
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 03               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key LLIM</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #fa8072;">"LLIM: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 04               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ULIM</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #fa8072;">"ULIM: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 05               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key STEP</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #fa8072;">"STEP: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 06               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key &#931;</span>
<span style="color: #00ffff;">CF</span> 84                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">84 clear -&gt; not a table</span>
<span style="color: #00ffff;">SF</span> 85                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">85 set   -&gt; sum</span>
<span style="color: #00ffff;">GTO</span> 20
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 07               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key &#960;</span>
<span style="color: #00ffff;">CF</span> 84                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">84 clear -&gt; not a table</span>
<span style="color: #00ffff;">CF</span> 85                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">85 clear   -&gt; product</span>
<span style="color: #00ffff;">GTO</span> 20
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 08               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key &#9618;</span>
<span style="color: #00ffff;">SF</span> 84                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">84 set -&gt;  table</span>
<span style="color: #00ffff;">GTO</span> 20
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 09               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key EQ</span>
1
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"PICF"</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 10               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key LN</span>
<span style="color: #00ffff;">FS?C</span> 82
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">SF</span> 82
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 11               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key IND</span>
<span style="color: #00ffff;">FS?C</span> 83
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">SF</span> 83
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 20  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Guts of the sum, product, table code</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Default LLIM &amp; STEP to 1 if unset</span>
1
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Check for bad LLIM, ULIM, &amp; STEP.</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 12
<span style="color: #fa8072;">"ERR: LLIM &#8805;"</span>
&#9500;<span style="color: #fa8072;">" ULIM"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 12
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">X&gt;0</span>?
<span style="color: #00ffff;">GTO</span> 14
<span style="color: #fa8072;">"ERR: STEP &#8804; 0"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 14
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">X&gt;0</span>?
<span style="color: #00ffff;">GTO</span> 15
<span style="color: #fa8072;">"ERR: EqD &#8804; 0"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 15
4
<span style="color: #00ffff;">X&#8805;Y</span>?
<span style="color: #00ffff;">GTO</span> 16
<span style="color: #fa8072;">"ERR: EqD &gt; 4"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 16
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Init before loop</span>
<span style="color: #00ffff;">FS</span>? 84          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">84 set -&gt; table</span>
<span style="color: #00ffff;">GTO</span> 21          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">84 clear -&gt; (85 set -&gt; sum , 85 clear -&gt; product)</span>
<span style="color: #00ffff;">GTO</span> 22
<span style="color: #00ffff;">LBL</span> 22
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Sum or Product</span>
<span style="color: #00ffff;">FS</span>? 85
0
<span style="color: #00ffff;">FC</span>? 85
1
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"SoP"</span>
<span style="color: #00ffff;">GTO</span> 23
<span style="color: #00ffff;">LBL</span> 21
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Table</span>
1
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">FS</span>? 83
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">NEWMAT</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"TMAT"</span>
R&#8595;    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Drop matrix off stack to save RAM</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"TMAT"</span>
<span style="color: #00ffff;">GROW</span>
<span style="color: #00ffff;">LBL</span> 23
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Step through independent variable values and do sum, product, or table</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">LBL</span> 24
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Print progress</span>
<span style="color: #00ffff;">CLA</span>
<span style="color: #00ffff;">ARCL</span> <span style="color: #fa8072;">"EqV"</span>
&#9500;<span style="color: #fa8072;">"="</span>
<span style="color: #00ffff;">ARCL</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">FC</span>? 84
<span style="color: #00ffff;">GTO</span> 32
<span style="color: #ffa500;">@@@@  </span><span style="color: #ff7f24;">Doing a table: Setup CTR for loop later</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"EqD"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #ffa500;">@@@@  </span><span style="color: #ff7f24;">Doing a table:  Store independent variable if FS? 83</span>
<span style="color: #00ffff;">FC</span>? 83
<span style="color: #00ffff;">GTO</span> 32
<span style="color: #00ffff;">RCL</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">STOEL</span>
<span style="color: #00ffff;">J+</span>
<span style="color: #00ffff;">LBL</span> 32
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Evaluate function</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">XEQ IND</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">GTO</span> 17
<span style="color: #fa8072;">"ERR: Func Eval"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 17
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Do thing for sum, product, or table</span>
<span style="color: #00ffff;">FS</span>? 84
<span style="color: #00ffff;">GTO</span> 26
<span style="color: #00ffff;">GTO</span> 27
<span style="color: #00ffff;">LBL</span> 27
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Sum or Product</span>
<span style="color: #00ffff;">FC</span>? 82
<span style="color: #00ffff;">GTO</span> 29
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">GTO</span> 29
<span style="color: #fa8072;">"ERR: Bad Log"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">LBL</span> 29
<span style="color: #00ffff;">FS</span>? 85
<span style="color: #00ffff;">STO+</span> <span style="color: #fa8072;">"SoP"</span>
<span style="color: #00ffff;">FC</span>? 85
<span style="color: #00ffff;">STO&#215;</span> <span style="color: #fa8072;">"SoP"</span>
<span style="color: #00ffff;">GTO</span> 28
<span style="color: #00ffff;">LBL</span> 26
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Table</span>
<span style="color: #00ffff;">LBL</span> 30
<span style="color: #00ffff;">FC</span>? 82
<span style="color: #00ffff;">GTO</span> 31
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">GTO</span> 31
<span style="color: #fa8072;">"ERR: Bad Log"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">LBL</span> 31
<span style="color: #00ffff;">STOEL</span>
<span style="color: #00ffff;">J+</span>
R&#8595;
<span style="color: #00ffff;">DSE</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">GTO</span> 30
<span style="color: #00ffff;">LBL</span> 28
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Increment independent variable</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">RCL</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">X&#8805;Y</span>?
<span style="color: #00ffff;">GTO</span> 24
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">All done.  Report Results</span>
<span style="color: #00ffff;">FS</span>? 84          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">84 set -&gt; table</span>
<span style="color: #00ffff;">GTO</span> 33          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">84 clear -&gt; (85 set -&gt; sum , 85 clear -&gt; product)</span>
<span style="color: #00ffff;">GTO</span> 19
<span style="color: #00ffff;">LBL</span> 19
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Sum or Product</span>
<span style="color: #00ffff;">FS</span>? 85
<span style="color: #fa8072;">"SUM: "</span>
<span style="color: #00ffff;">FC</span>? 85
<span style="color: #fa8072;">"PROD: "</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"SoP"</span>
<span style="color: #00ffff;">GTO</span> 18
<span style="color: #00ffff;">LBL</span> 33
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Table</span>
<span style="color: #00ffff;">CLA</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"TMAT"</span>
<span style="color: #00ffff;">LBL</span> 18
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
