docs/pgmforfun.html

<div id="outline-container-org7c0f809" class="outline-2">
<h2 id="org7c0f809"><span class="section-number-2">6</span> Programmatic Sums &amp; Products</h2>
<div class="outline-text-2" id="text-6">
<p>
If you already have <code>EqP</code>, <code>EqV</code>, <code>LLIM</code>, <code>ULIM</code>, &amp; <code>STEP</code> set, then you can use these programs.  These will be faster than the interactive version because they are optimized into tighter loops and because they don't provide any progress updates.
</p>
</div>

<div id="outline-container-org68bee0e" class="outline-3">
<h3 id="org68bee0e"><span class="section-number-3">6.1</span> <code>FSUM</code>: Sums</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FSUM" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FSUM)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Sum a function evaluated at regular intervals over a range</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: The sum</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: No error checking is done on LLIM, ULIM, STEP, EqV, or EqP</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Faster than sum in FSPT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: EqD is ignored -- only last function value is summed</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-06</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FSUM"</span>
<span style="color: #00ffff;">FUNC</span> 01
0
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"Sum"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Step through independent variable values and do sum</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">LBL</span> 24
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Evaluate function</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">XEQ IND</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">RTNERR</span> 2
<span style="color: #00ffff;">STO+</span> <span style="color: #fa8072;">"Sum"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Increment independent variable</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">RCL+</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">X&#8805;Y</span>?
<span style="color: #00ffff;">GTO</span> 24
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">All done, put Sum on stack</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"Sum"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org61b7529" class="outline-3">
<h3 id="org61b7529"><span class="section-number-3">6.2</span> <code>FPRD</code>: Products</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FPRD" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FPRD)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Product of a function evaluated at regular intervals over a range</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: The product</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: No error checking is done on LLIM, ULIM, STEP, EqV, or EqP</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Faster than product in FSPT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: EqD is ignored -- only last function value is summed</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-06</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FPRD"</span>
<span style="color: #00ffff;">FUNC</span> 01
1
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"Prd"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Step through independent variable values and do product</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">LBL</span> 24
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Evaluate function</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">XEQ IND</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">RTNERR</span> 2
<span style="color: #00ffff;">STO&#215;</span> <span style="color: #fa8072;">"Prd"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Increment independent variable</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">RCL+</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">X&#8805;Y</span>?
<span style="color: #00ffff;">GTO</span> 24
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">All done, put Prd on stack</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"Prd"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9188e92" class="outline-2">
<h2 id="org9188e92"><span class="section-number-2">7</span> Roots &amp; Integrals</h2>
<div class="outline-text-2" id="text-7">
<p>
Why?  These are built in!  True, but these make it easy to do an integration or find a root when <code>EqP</code>, <code>EqV</code>, <code>LLIM</code>, <code>ULIM</code>, &amp; <code>STEP</code> are already set.  For
example if you have just plotted a function, <code>FSLV</code> makes it easy to find a root in the plot range.
</p>
</div>

<div id="outline-container-org0f7d152" class="outline-3">
<h3 id="org0f7d152"><span class="section-number-3">7.1</span> <code>FSLV</code>: Find a root</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FSLV" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FSLV)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Use SOLVE to find a root for EqV in EqP on [LLIM, ULIM]</span>

<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: T: Code indicating solver exit reason</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">0 Found a root</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">1 Sign Reversal</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">2 Extremum</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">3 Bad Guess or Guesses</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">3 Constant?</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Z: EqP evaluated at X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Y: Previous best guess</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: Final best guess -- a root if we are lucky</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: No error checking is done on LLIM, ULIM, STEP, EqV, or EqP</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Faster than product in FSPT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: EqD is ignored -- only last function value is summed</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: EqP, EqV, LLIM, ULIM</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-06</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FSLV"</span>
<span style="color: #00ffff;">FUNC</span> 04
<span style="color: #00ffff;">PGMSLV</span> IND <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">SOLVE</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba51184" class="outline-3">
<h3 id="orgba51184"><span class="section-number-3">7.2</span> <code>FINT</code>: Integrate</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FINT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FINT)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Use INTEG to find a root for EqV in EqP on [LLIM, ULIM]</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: The integral</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: No error checking is done on ACC, LLIM, ULIM, STEP, EqV, or EqP</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: EqD is ignored -- only last function value is summed</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: EqP, EqV, LLIM, ULIM, ACC</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-06</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FINT"</span>
<span style="color: #00ffff;">FUNC</span> 03
<span style="color: #00ffff;">PGMINT</span> IND <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">INTEG</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>
