src/pgmforfun.org
* Evaluation

Sometimes you just need to quickly evaluate a function for several different input values.  

** =FEVL=: Quickly Evaluate A Function

I frequently use =VARMENU= to repeatedly evaluate a formula, with different input values.  Functionally that means typing in the value, and then hitting the
variable button twice.  That's not super efficient when repeatedly changing the same variable.  That's where this little function comes in.  

#+BEGIN_SRC hp42s :tangle ../src_42s/pgmforfun/pgmforfun.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:FEVL)
@@@@ DSC: Evaluate EqP at X
@@@@ OUT: X: EqP(x)
@@@@ FAQ: No error checking is done on EqV or EqP
@@@@ GBL: EqP, EqV
@@@@ UPD: 2021-04-09
@@@@ REQ: REQ:free42>=3.0
LBL "FEVL"
STO IND "EqV"
XEQ IND "EqP"
RTN
END
#+END_SRC

* Plots

Features:
   - Designed for high resolution mode of DM42
   - Dots are connected
   - Interactive zoom-box
   - Optional autoscale of y-axis
   - Control over axis and grid line drawing
   - Quick access to solver and integration from plot
   - Factor zoom
   - Default window
   - Minimal & efficient interface
   - Integrated with other tools on this page -- solver & integration

** User Interface

*** Main Menu

#+ATTR_HTML: :align center
|------+--------------------------------------------------|
| Menu | Description                                      |
|------+--------------------------------------------------|
| EQ   | Setup Equation                                   |
| XRNG | Set X range (X: max Y: min).  *MAGIC*            |
| YRNG | Set Y range (X: max Y: min).  *MAGIC*            |
| GRID | Set grid width (X: Y-width Y: X-width).  *MAGIC* |
| COMP | Computations (solve & integrate)                 |
| PLOT | Draw plot                                        |
|------+--------------------------------------------------|

Magic:
  - =XRNG= set to [0, 0]: Sets range to default [-10, 10].
  - =XRNG= reversed limits: Automatically detected and swapped
  - =XRNG= set to [M, M]: Zooms range by a factor of M.
  - =YRNG= set to [0, 0]: Sets range to default [-6, 6]
  - =YRNG= reversed limits: Automatically detected and swapped
  - =YRNG= set to [M, M]: Zooms range by a factor of M.
  - =GRID= set to 0:  If one of the grid widths is zero, then no grids are drawn for that axis
  - =GRID= set to a negative value:  No axis or grid marks will be drawn for that axis
  - =GRID=: If grid lines are closer than 10 pixels, then grids are suppressed.

For a graph with default settings: [0] [ENTER] [XRNG] [YRNG] [GRID] [PLOT]

** Computational Menu

This menu is for doing computations on the current equation based on
the current plot range or last zoom box region.

#+ATTR_HTML: :align center
|------+-----------------------------------------------------------------|
| Menu | Description                                                     |
|------+-----------------------------------------------------------------|
| ROOT | Find a root in plot range                                       |
| INTG | Integrate over plot range with ACC equal to the area of a pixel |
| EVAL | Evaluate the function                                           |
| ▒▒▒▒ | -                                                               |
| ▒▒▒▒ | -                                                               |
| R<>B | Swap plot range with last zoom box range                        |
|------+-----------------------------------------------------------------|

*** Graphics Display

#+ATTR_HTML: :align center
|-----------+------------------------------------------------------|
| Key       | Action                                               |
|-----------+------------------------------------------------------|
| =[2]=     | Adjust bottom side of zoom box                       |
| =[4]=     | Adjust left side of zoom box                         |
| =[8]=     | Adjust top side of zoom box                          |
| =[6]=     | Adjust right side of zoom box                        |
| =[ENTER]= | Zoom to box & Redraw                                 |
| =[X<>Y]=  | Auto-scale Y & Redraw.  Zoombox  is used for x-range |
| =[+]=     | Set zoom box adjustment speed to fast                |
| =[-]=     | Set zoom box adjustment speed to slow                |
| =[*]=     | Zoom out 2x (multiply ranges by 2)                   |
| =[/]=     | Zoom in 2x (divide ranges by 2)                      |
| =[←]=     | Exit to main menu.  Note: saves the zoom box range.  |
| =[.]=     | Toggle connected dots in graph                       |
|-----------+------------------------------------------------------|

