docs/pgmforfun.html

<div id="outline-container-org4f4e2f4" class="outline-2">
<h2 id="org4f4e2f4"><span class="section-number-2">8</span> Evaluation</h2>
<div class="outline-text-2" id="text-8">
<p>
Sometimes you just need to quickly evaluate a function for several different input values.  
</p>
</div>

<div id="outline-container-org6d87ca5" class="outline-3">
<h3 id="org6d87ca5"><span class="section-number-3">8.1</span> <code>FEVL</code>: Quickly Evaluate A Function</h3>
<div class="outline-text-3" id="text-8-1">
<p>
I frequently use <code>VARMENU</code> to repeatedly evaluate a formula, with different input values.  Functionally that means typing in the value, and then hitting the
variable button twice.  That's not super efficient when repeatedly changing the same variable.  That's where this little function comes in.  
</p>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FEVL" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FEVL)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Evaluate EqP at X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: EqP(x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: No error checking is done on EqV or EqP</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: EqP, EqV</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-09</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FEVL"</span>
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">XEQ IND</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgba40afc" class="outline-2">
<h2 id="orgba40afc"><span class="section-number-2">9</span> Plots</h2>
<div class="outline-text-2" id="text-9">
<p>
Features:
</p>
<ul class="org-ul">
<li>Designed for high resolution mode of DM42</li>
<li>Dots are connected</li>
<li>Interactive zoom-box</li>
<li>Optional autoscale of y-axis</li>
<li>Control over axis and grid line drawing</li>
<li>Quick access to solver and integration from plot</li>
<li>Factor zoom</li>
<li>Default window</li>
<li>Minimal &amp; efficient interface</li>
<li>Integrated with other tools on this page &#x2013; solver &amp; integration</li>
</ul>
</div>

<div id="outline-container-orgb43f792" class="outline-3">
<h3 id="orgb43f792"><span class="section-number-3">9.1</span> User Interface</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orga983677" class="outline-4">
<h4 id="orga983677"><span class="section-number-4">9.1.1</span> Main Menu</h4>
<div class="outline-text-4" id="text-9-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">EQ</td>
<td class="org-left">Setup Equation</td>
</tr>

<tr>
<td class="org-left">XRNG</td>
<td class="org-left">Set X range (X: max Y: min).  <b>MAGIC</b></td>
</tr>

<tr>
<td class="org-left">YRNG</td>
<td class="org-left">Set Y range (X: max Y: min).  <b>MAGIC</b></td>
</tr>

<tr>
<td class="org-left">GRID</td>
<td class="org-left">Set grid width (X: Y-width Y: X-width).  <b>MAGIC</b></td>
</tr>

<tr>
<td class="org-left">COMP</td>
<td class="org-left">Computations (solve &amp; integrate)</td>
</tr>

<tr>
<td class="org-left">PLOT</td>
<td class="org-left">Draw plot</td>
</tr>
</tbody>
</table>

<p>
Magic:
</p>
<ul class="org-ul">
<li><code>XRNG</code> set to [0, 0]: Sets range to default [-10, 10].</li>
<li><code>XRNG</code> reversed limits: Automatically detected and swapped</li>
<li><code>XRNG</code> set to [M, M]: Zooms range by a factor of M.</li>
<li><code>YRNG</code> set to [0, 0]: Sets range to default [-6, 6]</li>
<li><code>YRNG</code> reversed limits: Automatically detected and swapped</li>
<li><code>YRNG</code> set to [M, M]: Zooms range by a factor of M.</li>
<li><code>GRID</code> set to 0:  If one of the grid widths is zero, then no grids are drawn for that axis</li>
<li><code>GRID</code> set to a negative value:  No axis or grid marks will be drawn for that axis</li>
<li><code>GRID</code>: If grid lines are closer than 10 pixels, then grids are suppressed.</li>
</ul>

<p>
For a graph with default settings: [0] [ENTER] [XRNG] [YRNG] [GRID] [PLOT]
</p>
</div>
</div>
</div>

<div id="outline-container-org9a70ca7" class="outline-3">
<h3 id="org9a70ca7"><span class="section-number-3">9.2</span> Computational Menu</h3>
<div class="outline-text-3" id="text-9-2">
<p>
This menu is for doing computations on the current equation based on
the current plot range or last zoom box region.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ROOT</td>
<td class="org-left">Find a root in plot range</td>
</tr>

<tr>
<td class="org-left">INTG</td>
<td class="org-left">Integrate over plot range with ACC equal to the area of a pixel</td>
</tr>

<tr>
<td class="org-left">EVAL</td>
<td class="org-left">Evaluate the function</td>
</tr>

<tr>
<td class="org-left"></td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left"></td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">R&lt;&gt;B</td>
<td class="org-left">Swap plot range with last zoom box range</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgcb1af79" class="outline-4">
<h4 id="orgcb1af79"><span class="section-number-4">9.2.1</span> Graphics Display</h4>
<div class="outline-text-4" id="text-9-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Action</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[2]</code></td>
<td class="org-left">Adjust bottom side of zoom box</td>
</tr>

<tr>
<td class="org-left"><code>[4]</code></td>
<td class="org-left">Adjust left side of zoom box</td>
</tr>

<tr>
<td class="org-left"><code>[8]</code></td>
<td class="org-left">Adjust top side of zoom box</td>
</tr>

<tr>
<td class="org-left"><code>[6]</code></td>
<td class="org-left">Adjust right side of zoom box</td>
</tr>

<tr>
<td class="org-left"><code>[ENTER]</code></td>
<td class="org-left">Zoom to box &amp; Redraw</td>
</tr>

<tr>
<td class="org-left"><code>[X&lt;&gt;Y]</code></td>
<td class="org-left">Auto-scale Y &amp; Redraw.  Zoombox  is used for x-range</td>
</tr>

<tr>
<td class="org-left"><code>[+]</code></td>
<td class="org-left">Set zoom box adjustment speed to fast</td>
</tr>

<tr>
<td class="org-left"><code>[-]</code></td>
<td class="org-left">Set zoom box adjustment speed to slow</td>
</tr>

<tr>
<td class="org-left"><code>[*]</code></td>
<td class="org-left">Zoom out 2x (multiply ranges by 2)</td>
</tr>

<tr>
<td class="org-left"><code>[/]</code></td>
<td class="org-left">Zoom in 2x (divide ranges by 2)</td>
</tr>

<tr>
<td class="org-left"><code>[]</code></td>
<td class="org-left">Exit to main menu.  Note: saves the zoom box range.</td>
</tr>

<tr>
<td class="org-left"><code>[.]</code></td>
<td class="org-left">Toggle connected dots in graph</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
