docs/pgmforfun.html

<div id="outline-container-org8c6bb1c" class="outline-3">
<h3 id="org8c6bb1c"><span class="section-number-3">9.3</span> <code>FPLT</code>: Plot functions</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-FPLT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FPLT)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Plot a MVAR function</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: EqP, EqV, LLIM, ULIM, STEP, YMIN, YMAX, YSTP</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: ZLLIM, ZULIM -- zoom box limits.</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: STEP &amp; YSTP are used for grids</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 03: PREF: Set: draw dots only;  Clear: connect dots</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 04: PREF: Set: Use GrMod 2; Clear Use GrMod 3</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 05: PREF: Reserved</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 82: TEMP: Used for max/min computation</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 83: TEMP: Used for automatic autoscale redraw</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FLG: 84: TEMP: Reserved</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FRE: LBL: 79-99</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REQ: REQ:free42&gt;=3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-09</span>

<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FPLT"</span>
<span style="color: #00ffff;">FC</span>? 04
3
<span style="color: #00ffff;">FS</span>? 04
2
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"GrMod"</span>
R&#8595;
131
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ResX"</span>
R&#8595;
16
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ResY"</span>
R&#8595;
<span style="color: #00ffff;">XEQ</span> 74
<span style="color: #00ffff;">LBL</span> 01               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu FPLT</span>
<span style="color: #00ffff;">CF</span> 83                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Turn off auto yscale redraw</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"EQ"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 02
<span style="color: #fa8072;">"XRNG"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 03
<span style="color: #fa8072;">"YRNG"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 04
<span style="color: #fa8072;">"GRID"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 05
<span style="color: #fa8072;">"COMP"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 06
<span style="color: #fa8072;">"PLOT"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 07
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 00               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 02               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key EQ</span>
0
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"PICF"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 03               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key XRNG</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">GTO</span> 10               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">For shift we just display settings</span>
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 24
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 26
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Code for LLIM=ULIM&#8800;0</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"LLIM"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"LLIM"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RCL ST</span> X
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
R&#8595;
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">GTO</span> 10
<span style="color: #00ffff;">LBL</span> 26
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Code for LLIM=ULIM=0</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">XEQ</span> 74
<span style="color: #00ffff;">GTO</span> 10
<span style="color: #00ffff;">LBL</span> 24
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Code for LLIM&#8800;ULIM</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">LBL</span> 10
<span style="color: #fa8072;">"XMIN: "</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">"[LF]XMAX: "</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 04               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key YRNG</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">GTO</span> 50               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">For shift we just display settings</span>
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 22
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 23
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Code for YMIN=YMAX&#8800;0</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"YMIN"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"YMIN"</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RCL ST</span> X
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMIN"</span>
R&#8595;
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">GTO</span> 50
<span style="color: #00ffff;">LBL</span> 23
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Code for YMIN=YMAX=0</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"YMIN"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">XEQ</span> 74
<span style="color: #00ffff;">GTO</span> 50
<span style="color: #00ffff;">LBL</span> 22
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Code for YMIN&#8800;YMAX</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMIN"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">LBL</span> 50
<span style="color: #fa8072;">"YMIN: "</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMIN"</span>
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">"[LF]YMAX: "</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 05               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key GRID</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">GTO</span> 49               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">For shift we just display settings</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">LBL</span> 49
<span style="color: #fa8072;">"XSTP: "</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">"[LF]YSTP: "</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 06               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key COMP</span>
<span style="color: #00ffff;">LBL</span> 30               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">menu COMP</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"ROOT"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 32
<span style="color: #fa8072;">"INTG"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 33
<span style="color: #fa8072;">"EVAL"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 34
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">"RSV1"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">KEY 4 XEQ 35</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">"RSV2"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">KEY 5 XEQ 36</span>
<span style="color: #fa8072;">"R&lt;&gt;B"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 37
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 31
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 30
<span style="color: #00ffff;">LBL</span> 31               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Menu Exit</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 32               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key FSLV</span>
<span style="color: #00ffff;">FUNC</span> 04
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"FSLV"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 33               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key FINT</span>
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"ResX"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"YMIN"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"ResY"</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"FINT"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 34               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key RSV0</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"FEVL"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">RSV0</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 35               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key RSV1</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">RSV1</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 36               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key RSV2</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">RSV2</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 37               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key RANGE &lt;&gt; BOX swap</span>
<span style="color: #00ffff;">XEQ</span> 39
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"GrMod"</span>
<span style="color: #00ffff;">LBL</span> 07               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key PLOT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Set AGRAPH flags to OR</span>
<span style="color: #00ffff;">CF</span> 34
<span style="color: #00ffff;">CF</span> 35
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Just in case an important var is not set</span>
<span style="color: #00ffff;">XEQ</span> 74
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 76
R&#8595;
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 76
R&#8595;
<span style="color: #00ffff;">GTO</span> 77  <span style="color: #ffa500;">@@ </span><span style="color: #ff7f24;">All good</span>
<span style="color: #00ffff;">LBL</span> 76
<span style="color: #fa8072;">"ERR: Pick An"</span>
&#9500;<span style="color: #fa8072;">" EQ First!"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 77
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Set YWID</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"YMIN"</span>
1
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResY"</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YWID"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Set YWID</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResX"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"XWID"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw stuff</span>
<span style="color: #00ffff;">CLLCD</span>
<span style="color: #00ffff;">CLMENU</span>               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Only needed on DM42</span>
<span style="color: #00ffff;">EXITALL</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Only needed on DM42</span>
<span style="color: #00ffff;">FC</span>? 83
<span style="color: #00ffff;">GTO</span> 17
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Doing an autoscale draw</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResX"</span>
14
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">IP</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">LBL</span> 15
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResY"</span>
2
<span style="color: #00ffff;">&#247;</span>                             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Yctr</span>
9
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"I"</span>
14
<span style="color: #00ffff;">&#215;</span>                             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X coord</span>
<span style="color: #fa8072;">"@`px|~&#9500;~|xp`@"</span>               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw up triangle</span>
<span style="color: #00ffff;">AGRAPH</span>
<span style="color: #fa8072;">"&#215;&#8747;&#960;&#8594;&#8226;?&#9500;?&#8226;&#8594;&#960;&#8747;&#215;"</span>               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw down triangle</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
12
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">AGRAPH</span>
<span style="color: #00ffff;">DSE</span> <span style="color: #fa8072;">"I"</span>                       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Loopity doopity do</span>
<span style="color: #00ffff;">GTO</span> 15
<span style="color: #00ffff;">GTO</span> 20               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Jump past axis and grid drawing for autoscale redraw</span>
<span style="color: #00ffff;">LBL</span> 17
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw X Axis</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">X&lt;0</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">No axis if negative</span>
<span style="color: #00ffff;">GTO</span> 11
0
<span style="color: #00ffff;">XEQ</span> 56
<span style="color: #00ffff;">XEQ</span> 58
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">XEQ</span> 58
2
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ</span> 58
<span style="color: #00ffff;">LBL</span> 11
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw X Grid</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">X&#8804;0</span>?
<span style="color: #00ffff;">GTO</span> 08               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">no grid when STEP&lt;=0</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"XWID"</span>
10
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 08               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">no grid when too small</span>
R&#8595;
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">LBL</span> 09
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 46
<span style="color: #00ffff;">XEQ</span> 48
R&#8595;
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">GTO</span> 09
<span style="color: #00ffff;">LBL</span> 08
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw Y Axis</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">X&lt;0</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">No axis if negative</span>
<span style="color: #00ffff;">GTO</span> 12
0
<span style="color: #00ffff;">XEQ</span> 46
<span style="color: #00ffff;">XEQ</span> 48
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">XEQ</span> 48
2
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ</span> 48
<span style="color: #00ffff;">LBL</span> 12
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw Y Grid</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">X&#8804;0</span>?
<span style="color: #00ffff;">GTO</span> 20               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">no grid when STEP&lt;=0</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YWID"</span>
-10
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 20               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">no grid when too small</span>
R&#8595;
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMIN"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">LBL</span> 21
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 56
<span style="color: #00ffff;">XEQ</span> 58
R&#8595;
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">GTO</span> 21
<span style="color: #00ffff;">LBL</span> 20
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Set Alpha to our box</span>
<span style="color: #fa8072;">"&#960;&#960;&#960;"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Plot curve</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Init YPMAX &amp; YPMIN</span>
<span style="color: #00ffff;">SF</span> 82
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Init LASTY</span>
0
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"LASTY"</span>
R&#8595;
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Loop across screen</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResX"</span>
1000
<span style="color: #00ffff;">&#247;</span>
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"XICUR"</span>
<span style="color: #00ffff;">LBL</span> 41
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"XICUR"</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">STO</span> IND <span style="color: #fa8072;">"EqV"</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">XEQ IND</span> <span style="color: #fa8072;">"EqP"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 29
<span style="color: #00ffff;">FC</span>? 82
<span style="color: #00ffff;">GTO</span> 43
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Setup YPMIN &amp; YPMAX</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"YPMAX"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"YPMIN"</span>
<span style="color: #00ffff;">CF</span> 82
<span style="color: #00ffff;">LBL</span> 43
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Update YPMIN &amp; YPMAX if required.</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YPMAX"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"YPMAX"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YPMIN"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"YPMIN"</span>
<span style="color: #00ffff;">FC</span>? 83
<span style="color: #00ffff;">GTO</span> 78
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw autoscale progress bar</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResY"</span>
2
<span style="color: #00ffff;">&#247;</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"XICUR"</span>
<span style="color: #00ffff;">AGRAPH</span>
R&#8595;
R&#8595;
<span style="color: #00ffff;">GTO</span> 19
<span style="color: #00ffff;">LBL</span> 78
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">If y is on screen, then draw it</span>
<span style="color: #00ffff;">XEQ</span> 56
<span style="color: #00ffff;">XEQ</span> 55
<span style="color: #00ffff;">GTO</span> 29
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DRAW FAT PIXEL</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"XICUR"</span>
<span style="color: #00ffff;">XEQ</span> 51              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">@ XICUR YICUR</span>
R&#8595;
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Do we draw lines?</span>
<span style="color: #00ffff;">FS</span>? 03
<span style="color: #00ffff;">GTO</span> 19
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Don't do lines for an autoscale draw</span>
<span style="color: #00ffff;">FS</span>? 83
<span style="color: #00ffff;">GTO</span> 19
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Do we have a last point?</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LASTY"</span>
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 19
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Yep &amp; Yep.  We draw a line!</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"XICUR"</span>  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">xi  newy lasty</span>
<span style="color: #00ffff;">XEQ</span> 40
<span style="color: #00ffff;">LBL</span> 19
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Save last Y</span>
R&#8595;
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"LASTY"</span>
<span style="color: #00ffff;">GTO</span> 42
<span style="color: #00ffff;">LBL</span> 29  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Bad Y target</span>
0
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"LASTY"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Backend of loop</span>
<span style="color: #00ffff;">LBL</span> 42
<span style="color: #00ffff;">ISG</span> <span style="color: #fa8072;">"XICUR"</span>
<span style="color: #00ffff;">GTO</span> 41
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Done with graph.</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Setup zoom box</span>
10
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"FPZSPD"</span>
1
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBTOP"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBLFT"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResY"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBBOT"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResX"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBRGT"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Do we redraw with autoscale?</span>
<span style="color: #00ffff;">FS?C</span> 83
<span style="color: #00ffff;">GTO</span> 68
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">graph UI</span>
<span style="color: #00ffff;">LBL</span> 16
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">LBL</span> 52
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBRGT"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ</span> 48
<span style="color: #00ffff;">DSE</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">GTO</span> 52
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">LBL</span> 53
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBBOT"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ</span> 58
<span style="color: #00ffff;">DSE</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">GTO</span> 53
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">LBL</span> 54
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBTOP"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">XEQ</span> 58
<span style="color: #00ffff;">DSE</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">GTO</span> 54
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">LBL</span> 59
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBLFT"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">XEQ</span> 48
<span style="color: #00ffff;">DSE</span> <span style="color: #fa8072;">"CTR"</span>
<span style="color: #00ffff;">GTO</span> 59
<span style="color: #00ffff;">LBL</span> 44
GETKEY1
13
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">13 ENTER key</span>
<span style="color: #00ffff;">GTO</span> 73
R&#8595;
17
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">24 Backspace key</span>
<span style="color: #00ffff;">GTO</span> 60
R&#8595;
32
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">- speed slow key</span>
<span style="color: #00ffff;">GTO</span> 66
R&#8595;
37
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">- speed fast key</span>
<span style="color: #00ffff;">GTO</span> 65
R&#8595;
24
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">24 LEFT key</span>
<span style="color: #00ffff;">GTO</span> 61
R&#8595;
26
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">26 RIGHT key</span>
<span style="color: #00ffff;">GTO</span> 62
R&#8595;
20
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">20 TOP key</span>
<span style="color: #00ffff;">GTO</span> 63
R&#8595;
30
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">30 BOTTOM key</span>
<span style="color: #00ffff;">GTO</span> 64
R&#8595;
14
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">14 autoscale key</span>
<span style="color: #00ffff;">GTO</span> 68
R&#8595;
22
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">22 zoom in key</span>
<span style="color: #00ffff;">GTO</span> 67
R&#8595;
35
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">35 period.  toggle dots/lines</span>
<span style="color: #00ffff;">GTO</span> 75
R&#8595;
27
<span style="color: #00ffff;">X=Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">27 zoom out key</span>
<span style="color: #00ffff;">GTO</span> 69
<span style="color: #00ffff;">GTO</span> 44               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Nothing matched get another key</span>
<span style="color: #00ffff;">LBL</span> 67               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">22 / zoom</span>
0.5
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 03
<span style="color: #00ffff;">XEQ</span> 04
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">LBL</span> 69               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">27 x zoom out</span>
2.0
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 03
<span style="color: #00ffff;">XEQ</span> 04
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">LBL</span> 68               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Autoscale Y</span>
1
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBLFT"</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResX"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBRGT"</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 14
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Zoom box has been set</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBLFT"</span>
<span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBRGT"</span>
<span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">SF</span> 83
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">LBL</span> 14
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">No zoom box</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YPMAX"</span>
-5
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"YWID"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YPMIN"</span>
5
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"YWID"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMIN"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">LBL</span> 75               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">35 toggle dots/lines</span>
<span style="color: #00ffff;">FS?C</span> 03
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">SF</span> 03
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">LBL</span> 65               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">37 + set speed fast</span>
10
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">GTO</span> 16
<span style="color: #00ffff;">LBL</span> 66               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">32 - set speed slow</span>
1
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">GTO</span> 16
<span style="color: #00ffff;">LBL</span> 61               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LEFT REDO</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBRGT"</span>
-2
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"ZBLFT"</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBLFT"</span>
<span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ZLLIM"</span>
<span style="color: #00ffff;">GTO</span> 16
<span style="color: #00ffff;">LBL</span> 62               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">RIGHT REDO</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBLFT"</span>
2
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"ZBRGT"</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBRGT"</span>
<span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ZULIM"</span>
<span style="color: #00ffff;">GTO</span> 16
<span style="color: #00ffff;">LBL</span> 63               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TOP REDO</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBBOT"</span>
-2
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">+</span>                    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Upper_limit</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"ZBTOP"</span>         <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">@ New_ZBTOP Lower_limit</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBTOP"</span>
<span style="color: #00ffff;">GTO</span> 16
<span style="color: #00ffff;">LBL</span> 64               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BOT REDO</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBTOP"</span>
2
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">+</span>                    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Lower_limit</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"FPZSPD"</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"ZBBOT"</span>         <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">@ New_ZBBOT Lower_limit</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"ZBBOT"</span>
<span style="color: #00ffff;">GTO</span> 16
<span style="color: #00ffff;">LBL</span> 73
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBTOP"</span>
<span style="color: #00ffff;">XEQ</span> 57
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBBOT"</span>
<span style="color: #00ffff;">XEQ</span> 57
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMIN"</span>
R&#8595;
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBRGT"</span>
<span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZBLFT"</span>
<span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">LBL</span> 60
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 40  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw Line</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">xi newy lasty</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"XNUE"</span>
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">yn yo</span>
<span style="color: #00ffff;">RCL ST</span> Y        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">yo yn yo</span>
<span style="color: #00ffff;">RCL- ST</span> Y       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">yo-yn yn yo</span>
<span style="color: #00ffff;">ABS</span>             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">|yo-yn| yn yo</span>
3
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">RTN</span> <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Pts too close, no line to draw</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">We are drawing a line!</span>
R&#8595;
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">yn yo</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"YNUE"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"YOLD"</span>     <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">yo yn</span>
<span style="color: #00ffff;">+</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"YCTR"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">CTR -&gt; OLD Y</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"XNUE"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YOLD"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YCTR"</span>
<span style="color: #00ffff;">XEQ</span> 70
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">CTR -&gt; NEW Y</span>
R&#8595;
R&#8595;
R&#8595;
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"XNUE"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YNUE"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YCTR"</span>
<span style="color: #00ffff;">XEQ</span> 70
R&#8595;
R&#8595;
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 70          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw Fat, Vertical Line Segment   Ystart Yend X .  Yend already has a fat point drawn.</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">GTO</span> 71
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Line going up</span>
1
<span style="color: #00ffff;">STO- ST</span> T
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Ystart Yend X-1</span>
1
<span style="color: #00ffff;">STO- ST</span> Z
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Ystart Yend-1 X-1</span>
3
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Ystart-3 Yend+1 X-1</span>
<span style="color: #00ffff;">LBL</span> 72          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ycur Yend-1 X-1</span>
<span style="color: #00ffff;">RCL ST</span> Z        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X-1 ycur Yend-1 X-1</span>
<span style="color: #00ffff;">AGRAPH</span>
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ycur Yend-1 X-1</span>
3
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ycur(updated) Yend-1 X-1</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 72
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 71
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Line going down</span>
1
<span style="color: #00ffff;">STO- ST</span> T
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Ystart Yend X-1</span>
1
<span style="color: #00ffff;">STO- ST</span> Z
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Ystart Yend-1 X-1</span>
<span style="color: #00ffff;">LBL</span> 18          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Ycur Yend-1 X-1</span>
<span style="color: #00ffff;">RCL ST</span> Z        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X-1 Ycur Yend-1 X-1</span>
<span style="color: #00ffff;">AGRAPH</span>
R&#8595;              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">yc yn+1 xn-1</span>
3
<span style="color: #00ffff;">+</span>               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">yc yn+1 xn-1</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">GTO</span> 18
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 51               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Draw BIG Pix  (assumes Alpha is set)</span>
<span style="color: #00ffff;">FUNC</span> 00
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">AGRAPH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 58               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">HLINE</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">XEQ</span> 55
<span style="color: #00ffff;">GTO</span> 27
<span style="color: #00ffff;">+/-</span>
1
<span style="color: #00ffff;">PIXEL</span>
<span style="color: #00ffff;">LBL</span> 27
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 48               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">VLINE</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">XEQ</span> 45
<span style="color: #00ffff;">GTO</span> 28
<span style="color: #00ffff;">+/-</span>
1
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">PIXEL</span>
<span style="color: #00ffff;">LBL</span> 28
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 45               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X Out Of Range</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">X&#8804;0</span>?
<span style="color: #00ffff;">RTNYES</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResX"</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">RTNYES</span>
<span style="color: #00ffff;">RTNNO</span>
<span style="color: #00ffff;">LBL</span> 55               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Y Out Of Range</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">X&#8804;0</span>?
<span style="color: #00ffff;">RTNYES</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ResY"</span>
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">RTNYES</span>
<span style="color: #00ffff;">RTNNO</span>
<span style="color: #00ffff;">LBL</span> 46               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">XR-&gt;XI</span>
<span style="color: #00ffff;">FUNC</span> 11
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"XWID"</span>
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 47               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">XI-&gt;XR</span>
<span style="color: #00ffff;">FUNC</span> 11
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"XWID"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 56               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">YR-&gt;YI</span>
<span style="color: #00ffff;">FUNC</span> 11
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RCL&#247;</span> <span style="color: #fa8072;">"YWID"</span>
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 57               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">YI-&gt;YR</span>
<span style="color: #00ffff;">FUNC</span> 11
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"YWID"</span>
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 39               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Swap rng &amp; box</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZLLIM"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 38
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ZULIM"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 38
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 38
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 38
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ZULIM"</span>
R&#8595;
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ZLLIM"</span>
R&#8595;
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #fa8072;">"XMIN: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
R&#8595;
&#9500;<span style="color: #fa8072;">"[LF]XMAX: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
R&#8595;
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 38
<span style="color: #fa8072;">"ERR: Range or "</span>
<span style="color: #fa8072;">"&#9500; unset"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 74   <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Set any unset global variables to defaults</span>
10
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"ULIM"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"ULIM"</span>
-10
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"LLIM"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"LLIM"</span>
6
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMAX"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMAX"</span>
-6
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YMIN"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YMIN"</span>
0
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"YSTP"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"YSTP"</span>
0
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"STEP"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>
